Од стандарден влез се внесуваат два цели броја N и Х.

Да се најде најблискот број помал од N коj е тотално различен од бројот Х.

Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.

Задачата да се реши без употреба на низи и матрици.

#include <stdio.h>

int main() {
       int N,X;
        scanf("%d%d", &N, &X);
        N--;
        
        for(N; N>0; N--) {
            int flag=0;
            for(int i=N; i!=0; i/=10){
                for(int j=X; j!=0; j/=10){
                    if(i%10==j%10)
                        flag=1;
                }
            }
        if(!flag) break;
}
printf("%d", N);
    return 0;
}