Од стандарден влез се читаат два броја m и n. Да се напише програма која што ќе ги испечати факториелите на броевите во опсегот (m, n].

Објаснување: Факториел на даден број се пресметува: 3! = 3*2*1 = 6

Напомена: За да го сместите резултатот од добиениот факториел користете long репрезентација на број. За печатење на истиот се користи %ld. 

#include <stdio.h>

int main() {
    
    int M, N;
    scanf("%d%d", &M, &N);
    
    for(int i=M+1; i<=N; i++) {
        long int zbir=1;
        for(int j=i; j>0; j--) {
            zbir*=j;
        }
        printf("Faktoriel od %d e %ld.\n", i, zbir);
    }
    return 0;
}