Постојат 4 сезони кои наизменично се менуваат: esen, zima, prolet, leto. Секој студент започнува да студира во есен, и понатаму продолжува во следните сезони. Ако за некој студент знаеме дека студирал 18 сезони, значи дека завршил во осумнаесеттата сезона, односно завршил со студирање во зима. Од тастатура се внесува даден природен број N (N<100) кој претставува број на студенти, и потоа се внесуваат N други природни броеви кои претставуваат по колку сезони студирал секој од N-те студенти. За секој од внесените броеви, во посебен ред, да се отпечати во која сезона завршил студентот.

#include <stdio.h>

int main() {
    
    int N;
    scanf("%d", &N);
    
    for(int i=0; i<N; i++) {
        int broj;
        scanf("%d", &broj);
        if(broj%4==0) {
            printf("leto");
        }
        if(broj%4==1) {
            printf("esen");
        }
        if(broj%4==2) {
            printf("zima");
        }
        if(broj%4==3) {
            printf("prolet");
        }
        printf("\n");
    }
    return 0;
}