Подреден број е број кај кој секоја следна цифра е поголема или еднаква на претходната (гледајќи од најзначајната кон најмалку значајната). На пример, 12234.

Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура. Потоа се внесуваат N-те броеви, еден по еден. На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за подреден број, а потоа да се отпечати сумата на сите внесени Подредени броеви и нивниот број.


Пример за влез

Пример за излез

5

11

341

12

876

1257

11

12

1257

1280

3

#include <stdio.h>

int main() {
    
    int N;
    scanf("%d", &N);
    int suma=0, brojac=0;
    for(int i=0; i<N; i++) {
        int broj;
        scanf("%d", &broj);
        int x=0;
        x=broj;
        int flag=1;
        int poslednacifra=x%10;
        x=x/10;
        while(x>0) {
           int cifra=x%10;
            if(poslednacifra<cifra) {
                flag=0;
                break;
            }
            poslednacifra=cifra;
            x/=10;
        }
        if(flag) {
            brojac++;
            suma=suma+broj;
            printf("%d\n", broj);
        }
    }
    printf("%d\n%d", suma, brojac);
    return 0;
}